In [2]:
import pandas as pd

obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj.values

array([ 4,  7, -5,  3])

In [4]:
obj.index  # like range(4)

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj1 = pd.Series(['a','b', 'c', 'd'])
obj1

0    a
1    b
2    c
3    d
dtype: object

In [17]:
obj2 = pd.Series(['a','b', 'c', 'd'], index =[5,10,15,20])
obj2

5     a
10    b
15    d
20    c
dtype: object

In [19]:
obj3 = pd.Series( {"ID":5430,"Name":"Muhammad Adnan","Designation":"iPhone Developer"})
obj3.name = "Employees"
obj3.index.name = "#S Number"
obj3

#S Number
ID                         5430
Name             Muhammad Adnan
Designation    iPhone Developer
Name: Employees, dtype: object

In [20]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [18]:
obj2.reindex(range(2), method='ffill')
obj2

5     a
10    b
15    d
20    c
dtype: object

In [29]:
obj2[5]
obj2[5] = "f"
obj2

5     f
10    b
15    c
20    d
dtype: object

In [21]:
data = [[1,2,3],
        [4,5,6],
        [7,8,9]
       ]

pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year  state  pop
0     1      2    3
1     4      5    6
2     7      8    9

In [22]:
frame1 = pd.DataFrame([
    {"Day":"Monday","Temp":107,"Windy": True},
    {"Day":"Tuesday","Temp":127,"Windy": False},
    {"Day":"Wednessday","Temp":237,"Windy": True}

])
frame1

          Day  Temp  Windy
0      Monday   107   True
1     Tuesday   127  False
2  Wednessday   237   True

In [39]:
frame1 = pd.DataFrame([
    (1,107 ,True),
    (2,127 ,False),
    (3,237 ,True)
],
    columns = ["Day","Temp","Windy"]
)
frame1.to_excel("temp2.xlsx", sheet_name = "Adnan")
frame1

   Day  Temp  Windy
0    1   107   True
1    2   127  False
2    3   237   True

In [26]:
frame1 = pd.read_excel('temp2.xlsx')
frame1

   Unnamed: 0  Day  Temp  Windy
0           0    1   107   True
1           1    2   127  False
2           2    3   237   True

In [41]:
frame1 = pd.DataFrame([
    (1,107 ,True),
    (2,127 ,False),
    (3,237 ,True)
],
    columns = ["Day","Temp","Windy"]
)
frame1.to_csv("temp2.csv")
frame1

   Day  Temp  Windy
0    1   107   True
1    2   127  False
2    3   237   True

In [24]:
import pandas as pd
frame1 = pd.read_csv('temp2.csv')
frame1[["Windy","Day"]]  #getting specific colums data

   Windy  Day
0   True    1
1  False    2
2   True    3

In [29]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', "Ali"],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

#keys become colum names and values become rows
frame = pd.DataFrame(data)
frame
frame.sum()

state    OhioOhioOhioNevadaNevadaAli
year                           12009
pop                             15.3
dtype: object

In [31]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop'],
                      index=['one', 'two', 'three', 'four',
                           'five', 'six'])
'''
frame2.columns
frame2['year']
frame2.year
'''

frame2

       year   state  pop
one    2000    Ohio  1.5
two    2001    Ohio  1.7
three  2002    Ohio  3.6
four   2001  Nevada  2.4
five   2002  Nevada  2.9
six    2003     Ali  3.2

In [32]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
Name: three, dtype: object